(function () {
  console.log('Yaroslava Hryzadubova. Shelter. Part1\n------------------------------------------\nScore 100/100\n');
  console.log('Оценка по пунктам:\n------------------------------------------\n');
  
  console.log('[+60] Страница Main\n');

  console.log('1. [+7] Проверка верстки\n');
  console.log('- верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . +4. Валидной вёрстке соответствует надпись - Document checking completed. No errors or warnings to show.- В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований\n');
  console.log('- логотип в хедере состоит из текстовых элементов +1\n');
  console.log('- страница содержит ровно один элемент <h1> +1\n');
  console.log('- добавлен favicon +1\n');

  console.log('2. [+35] Вёрстка соответствует макету\n');
  console.log('- блок header +5\n');
  console.log('- блок Not only +5\n');
  console.log('- блок About +5\n');
  console.log('- блок Our Friends +5\n');
  console.log('- блок Help +5\n');
  console.log('- блок In addition +5\n');
  console.log('- блок footer +5\n');

  console.log('3. [+6] Требования к css\n');
  console.log('-для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid) +2\n');
  console.log('- при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине +2\n');
  console.log('- фоновый цвет тянется на всю ширину страницы +2\n');

  console.log('4. [+12] Интерактивность элементов\n');
  console.log('- элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2\n');
  console.log('- каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки +2\n');
  console.log('- плавная прокрутка по якорям +2\n');
  console.log('- выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main +2\n');
  console.log('- выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2\n');
  console.log('- обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы +2\n');
  
  console.log('[+40] Страница Pets\n');
  console.log('5. [+7] Проверка верстки\n');
  console.log('- верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . +4. Валидной вёрстке соответствует надпись - Document checking completed. No errors or warnings to show.- В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований\n');
  console.log('- логотип в хедере состоит из текстовых элементов +1\n');
  console.log('- страница содержит ровно один элемент <h1> +1\n');
  console.log('- добавлен favicon +1\n');

  console.log('6. [+15] Вёрстка соответствует макету\n');
  console.log('- блок header +5\n');
  console.log('- блок Our Friends +5\n');
  console.log('- блок footer +5\n');

  console.log('7. [+4] Требования к css\n');
  console.log('- при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине +2\n');
  console.log('- фоновый цвет тянется на всю ширину страницы +2\n');

  console.log('8. [+12] Интерактивность элементов\n');
  console.log('- элемент Our pets в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2\n');
  console.log('- доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) +2\n');
  console.log('- каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки +2\n');
  console.log('- плавная прокрутка по якорям +2\n');
  console.log('- выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Pets +2\n');
  console.log('- выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2\n');
  console.log('- обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы +2\n');

}());