(function () {
  console.log('Yaroslava Hryzadubova. Shelter. Part3\n------------------------------------------\nScore 0/110\n');
  console.log('Оценка по пунктам:\n------------------------------------------\n');
  
  console.log('1. [+26] Реализация burger menu на обеих страницах: \n');
  console.log('- при ширине страницы меньше 768рх панель навигации скрывается, появляется бургер-иконка: +2 \n');
  console.log('- при нажатии на бургер-иконку, справа плавно появляется адаптивное меню шириной 320px, бургер-иконка плавно поворачивается на 90 градусов: +4 \n');
  console.log('- высота адаптивного меню занимает всю высоту экрана: +2 \n');
  console.log('- при повторном нажатии на бургер-иконку или на свободное от бургер-меню пространство адаптивное меню плавно скрывается уезжая за правую часть экрана, бургер-иконка плавно поворачивается на 90 градусов обратно: +4 \n');
  console.log('- бургер-иконка создана при помощи html+css, без использования изображений: +2 \n');
  console.log('- ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям, сохраняются заданные на первом этапе выполнения задания требования интерактивности элементов меню: +2 \n');
  console.log('- при клике по любой ссылке (интерактивной или неинтерактивной) в меню адаптивное меню плавно скрывается вправо, бургер-иконка поворачивается на 90 градусов обратно: +2 \n');
  console.log('- расположение и размеры элементов в бургер-меню соответствует макету (центрирование по вертикали и горизонтали элементов меню, расположение иконки). При этом на странице Pets цветовая схема может быть как темная, так и светлая: +2 \n');
  console.log('- область, свободная от бургер-меню, затемняется: +2 \n');
  console.log('- страница под бургер-меню не прокручивается: +4 \n');
  console.log('2. [+36] Реализация слайдера-карусели на странице Main:  \n');
  
  console.log('3. [+36] Реализация пагинации на странице Pets: \n');
  console.log('4. [+12] Реализация попап на обеих страницах: \n');
  
  console.log('- блок <footer>: +2 \n');
 
  
}());